import React, {useEffect, useRef, useState} from 'react';
import {useAppDispatch} from "../app/hooks/useAppDispatch";
import {fetchViolationTypes} from "../features/violationTypes/violationTypesThunks";
import ViolationForm from "../components/Forms/ViolationForm";

interface ExpandedState {
  [key: string]: boolean;
}

const NewReport: React.FC = () => {
  const [expanded, setExpanded] = useState<ExpandedState>({
    block1: false,
    block2: false,
    block3: false,
  });
  const dispatch = useAppDispatch();
  const sectionRef = useRef<HTMLDivElement>(null);

  useEffect(() => {
    dispatch(fetchViolationTypes());
  }, [dispatch]);

  const toggleContent = (blockId: string): void => {
    setExpanded((prev) => ({
      ...prev,
      [blockId]: !prev[blockId],
    }));
  };

  const scrollToSection = () => {
    if (sectionRef.current) {
      sectionRef.current.scrollIntoView({behavior: 'smooth'});
    }
  };

  return (
    <div
      className="flex flex-col-reverse lg:flex-row gap-8 max-w-[1792px] w-full mx-auto px-6 lg:px-16 py-12 font-inter"
    >
      <ViolationForm />

      <div className="flex-1 mb-10 lg:mb-0 text-[15px] leading-[24px] text-slateBody space-y-3">
        <h2 className="text-[24px] font-extrabold text-navy mb-5">Форманы кантип толтуруу керек?</h2>
        <p className="">
          Мыйзам <span className="font-bold text-goldDeep hover:underline cursor-pointer"
                       onClick={scrollToSection}>бузуулардын түрлөрү</span> жөнүндө кененирээк маалымат
          менен таанышыңыз. Сиз байкаган мыйзам бузуунун түрүн тандаңыз. Формадагы талааларды толтуруңуз. Кызыл жылдыз
          (<span className="text-red-500 font-bold">*</span>) менен белгиленген талаалар сөзсүз толтурулушу керек.
        </p>
        <p className="">
          Сиз карта администраторлору жана башка колдонуучулар үчүн анонимдүү бойдон каласыз. Купуялуулугуңузду сактоо
          максатында бизге так жашаган дарегиңизди көрсөтпөй эле, географиялык жайгашкан жериңиз жөнүндө жалпы маалымат
          бериңиз
        </p>
        <p className="">
          Форманы толтуруп жөнөткөн соң, модераторлор сиздин билдирүүңүздү эксперттерге карап чыгуу жана баалоо үчүн
          жөнөтөт. Эгер сиздин билдирүүңүз текшерүү учурунда тастыктоодон өтпөсө, анда ал картада көрсөтүлбөйт.
        </p>
        <p className="">
          Сиз белгилеген жердеги (облус, район, шаар/шаарча/айыл) картадагы мыйзам бузуу иконкасын басуу менен
          эксперттердин комментарийлери менен тааныша аласыз.
        </p>
        <p className="font-bold mt-4">
          Кызматташуу үчүн рахмат!
        </p>
        <p className="font-bold mt-2">
          Медиа сабаттуу болуңуз!
        </p>

        <h1 className="text-[22px] font-extrabold text-navy mt-8" ref={sectionRef}>Бузуулардын түрлөрү:</h1>

        <h2 className="text-[19px] font-bold text-ink mt-6">Жалган маалымат</h2>
        <div>
          {expanded.block1 && (<div>
            <p className="my-2"><span className="font-semibold">Жалган маалымат</span> - бул аудиторияны адаштыруу же
              манипуляциялоо үчүн атайылап таратылган маалымат. Катачылыктардан жана так эместиктерден айырмаланып,
              дезинформация атайылап түзүлөт жана таратылат.
            </p>
            <h3 className="font-semibold mt-4 mb-2">Жалган маалыматтын түрлөрү:</h3>
            <ul className="list-disc pl-5 space-y-2">
              <li><span className="font-semibold">Жалган жаңылыктар (Fake News):</span> Булар чыныгы жаңылык катары
                жашырылган, толугу менен ойдон чыгарылган окуялар. Алар көбүнчө чыныгы жаңылык ресурстарын туураган
                сайттарда жарыяланат жана социалдык тармактар аркылуу таратылат. Алар чыныгы жана жасалма сүрөттөрдү,
                видеолорду жана цитаталарды да колдоно алышат.
              </li>
              <li><span className="font-semibold">Жалган цитаталар:</span> Белгилүү инсандарга алар эч качан айтпаган же
                жазбаган билдирүүлөрдү ыйгаруу.
              </li>
              <li><span className="font-semibold">Пропаганда:</span> Белгилүү бир идеологияны же саясий көз карашты
                жайылтуу, алга жылдыруу максатында маалымат таратуу. Бул учурда фактылар атайын бурмаланып, четке
                кагылуусу мүмкүн жана пропаганданын булагынын кызыкчылыктарына ылайыктап түшүндүрүлөт.
              </li>
              <li><span className="font-semibold">Комментарийлер аркылуу троллинг:</span> Чагымчыл же кемсинткен
                комментарийлерди атайылап жайылтуу аркылуу чыр-чатакты козутуу жана жалган маалымат таратуу.
              </li>
              <li><span className="font-semibold">Deepfakes:</span> Жасалма интеллекттин жардамы менен түзүлгөн жасалма
                видео же аудиожазуулар, алар өтө реалдуу көрүнгөнү менен, чындыгында, чындыкка дал келбейт. Буларды
                саясий пропагандада, санариптик алдамчылыкта жана жеке адамдарды каралоо үчүн колдонуу өсүп жаткан
                көйгөй.
              </li>
              <li><span className="font-semibold">Кутум теориялары:</span> Кутум теориясы деген – бул бир окуя же
                көрүнүштү адамдар өздөрү ойлоп тапкан, далили жок, тастыкталбаган ойлор менен түшүндүрүү. Мисалы,
                айрымдар чоң окуяларды жашыруун топтор же уюмдар атайлап жасап жатат деп ишенишет. Бирок бул нерселер
                көбүнчө чындыкка дал келбейт жана жөн эле сөз бойдон калат. Алар жалган маалыматтарга негизделип,
                фактылар менен тастыкталбайт.
              </li>
            </ul>

            <h3 className="font-semibold mt-4 mb-2">Жалган маалыматты таратуу ыкмалары:</h3>
            <ul className="list-disc pl-5 space-y-2">
              <li><span className="font-semibold">Социалдык тармактар жана жасалма аккаунттар:</span> Жасалма
                маалыматты, өзгөчө кеңири аудиторияга жайылтуунун тез жана натыйжалуу жолу социалдык тармактар болуп
                саналат.
                <p className="indent-5 font-bold my-2">Жасалма аккаунттардын белгилери:</p>
                <ul className="list-disc pl-10 space-y-2">
                  <li>
                    Чектелген иш-аракеттердин тарыхы менен жакында эле түзүлгөн аккаунттар.
                  </li>
                  <li>
                    <span className="font-semibold">Массалык жарыялоо же репосттор:</span>
                    Бирдей комментарийлер же жоопторду башка колдонуучулардын жазгандарына кайталап берүү.
                  </li>
                  <li>
                    <span className="font-semibold">Сүрөттөрдү колдонуу:</span>
                    Генерацияланган же интернеттен уурдалган адамдардын сүрөттөрүн профилдик сүрөт катары колдонуу.
                  </li>
                  <li>
                    <span className="font-semibold">Жеке маалыматтын жоктугу:</span>
                    Профилде жана баракчада жеке жашоосу тууралуу маалыматтын жоктугу – мисалы, жашаган жери, жумушу,
                    кызыкчылыктары, сүрөттөрү жана өзү тууралуу посттор.
                  </li>
                  <li>
                    <span className="font-semibold">Координацияланган аракеттерге катышуу:</span>
                    Белгилүү бир ачкыч сөздөрдү же темаларды жайылтууда уюшулган кампанияларда катышуу.Билдирүүлөрдүн
                    жана комментарийлердин окшоштугу.
                  </li>
                </ul>
              </li>
              <li><span className="font-semibold">Мессенджерлер:</span> Маалыматты жабык топтордо жана чаттарда таратуу
                аркылуу белгилүү бир аудиторияга кыска убакыттын ичинде жетүү.
              </li>
              <li><span className="font-semibold">Электрондук почта:</span> Колдонуучуларга жалган маалыматтарды
                жөнөтүү, шилтемелерди басып кирүүнү сунуштоо, же анкеталарды толтурууну талап кылуу, анда жеке
                маалыматтар суралат.
              </li>
              <li><span className="font-semibold">Веб-сайттар:</span> Жалган маалыматты таратуу үчүн сайттарды түзүү.
                Бул сайттар банктарга, мамлекеттик органдарга, компанияларга, белгилүү уюмдарга же популярдуу маалымат
                каражаттарына окшошуп көрсөтүлүшү мүмкүн.
              </li>
            </ul>

            <p className="text-red-500 mt-4 mb-2">
              <strong>
                Маанилүү!!! Жалган маалымат олуттуу кесепеттерге алып келиши мүмкүн, анын ичинде:
                <ul>
                  <li>
                    Жалпыга маалымдоо каражаттарына жана мамлекеттик органдарга болгон ишенимдин төмөндөшү.
                  </li>
                  <li>
                    Коомду экиге бөлүп, талаш-тартыштарды күчөтөт
                  </li>
                  <li>
                    Демократиялык процесстерге доо келтирүү.
                  </li>
                  <li>
                    Зомбулуктун жана агрессиянын өсүшү.
                  </li>
                  <li>
                    Адамдардын ден соолугуна жана жашоосуна зыян келтирүү.
                  </li>
                  <li>
                    Экономикалык жана каржылык жоготуулар.
                  </li>
                </ul>
                Маалыматты текшерүү жана сынчыл ой-жүгүртүү жана бир нече булактардан алынган маалыматты текшерүү жана
                жалган маалыматтын белгилерин таануу маалыматтык доордо абдан маанилүү көндүмдөр.
              </strong>
            </p>
          </div>)}
          <button
            className="mt-2 text-[14px] font-semibold text-goldDeep hover:underline"
            onClick={() => toggleContent('block1')}
          >
            {expanded.block1 ? 'Жашыруу' : 'Толугураак окуу...'}
          </button>
        </div>

        <h2 className="text-[19px] font-bold text-ink mt-6">Кастык тили же Жек көрүүчүлүк сөздөр</h2>
        <div>
          {expanded.block2 && (<div>
            <p className="my-2"><span className="font-semibold">Кастык тили же Жек көрүүчүлүк сөздөр</span> - зомбулукту
              же дискриминацияны үгүттөгөн, козгогон, же расасы, дини, улуту, жынысы, сексуалдык ориентациясы, майыптыгы
              же башка өзгөчөлүктөрү боюнча топко же адамга каршы багытталган ар кандай формасы. Бул жөн гана кемсинтүү
              эмес, душмандык атмосфераны түзүүгө жана социалдык туруктуулукту бузууга багытталган максаттуу билдирүүлөр
              болуп саналат.
            </p>
            <p className="my-2">
              Сын менен жек көрүүчүлүктү айырмалоо маанилүү. Сын катуу болушу мүмкүн, бирок ал адамдардын тобуна эмес, конкреттүү иш-аракеттерге же саясатка багытталган. Жек көрүүчүлүк сөздөр болсо топту адамгерчиликтен ажыратууга багытталган.
            </p>

            <h3 className="font-semibold mt-4 mb-2">Кастык тилинин түрлөрү:</h3>
            <ul className="list-disc pl-5 space-y-2">
              <li><span className="font-semibold">Ксенофобия:</span> Бул башка өлкөдөн келген же башка маданияттагы адамдарды жактырбоо, алардан коркуу же жек көрүү. Мисалы, коңшу өлкөдөн келген мигранттарды жакшы көрбөй, аларга терс мамиле кылуу.
              </li>
              <li><span className="font-semibold">Диний чыдамсыздык:</span> Белгилүү бир диний агымдардын мүчөлөрүнө каршы багытталган, көбүнчө кемсинтүү же зомбулукка чакыруу менен коштолгон сөздөр.
              </li>
              <li><span className="font-semibold">Аялдарга карата жек көрүүчүлүк сөздөр:</span> Зомбулукту же аялдардын укуктарынан ажыратууну актаган жек көрүүчүлүк сөздөр. Бул терс стереотиптер, зомбулукка чакырыктар, аялдардын укуктарынан ажыратуу - мисалы, шайлоого катышуу, карьера куруу, чет өлкөгө чыгуу ж.б. түрүндө чагылдырылышы мүмкүн.
              </li>
              <li><span className="font-semibold">Онлайн буллинг (кибербуллинг):</span> Бул социалдык тармактарда же мессенджерлерде башка адамдарды кемсинтип, жаман сөздөрдү жазуу, коркутуп-үркүтүү. Мындай аракеттер белгилүү бир адамдарга же топторго атайын багытталат жана алардын абийирине, тынчтыгына зыян келтириши мүмкүн.
              </li>
              <li><span className="font-semibold">Саясий дискурстагы жек көрүүчүлүк сөздөр:</span> Саясатчылар же саясий партиялар, алардын өкүлдөрү жана тарапкерлери тарабынан өз максаттарына жетүү үчүн, социалдык мааниге ээ маселелерди талкуулоодо, ошондой эле шайлоо өнөктүгү учурунда жек көрүүчүлүктү чагылдырган сөздөрдү колдонуу.
              </li>
            </ul>
            <p className="text-red-500 font-bold mt-4 mb-2">
              <p><strong>Маанилүү!!! Жек көрүүчүлүк олуттуу кесепеттерге алып келиши мүмкүн:</strong></p>
              <ul className="list-disc pl-5 space-y-2">
                <li>Коомдогу чыңалуулардын жана чыр-чатактардын өсүшү.</li>
                <li>Айрым топтордун өкүлдөрүн басмырлоо жана куугунтуктоо, алардын ден соолугуна, мүлкүнө жана өмүрүнө олуттуу зыян алып келиши мүмкүн.
                </li>
                <li>Зомбулуктун жана жек көрүүчүлүккө негизделген кылмыштардын көбөйүшү.</li>
                <li>Мамлекеттик органдарга жана мекемелерге болгон ишенимдин төмөндөшү.</li>
                <li>Улуттар жана диндер аралык мамилелердин начарлап, коомдук биримдиктин бузулушу.</li>
              </ul>
            </p>
          </div>)}
          <button
            className="mt-2 text-[14px] font-semibold text-goldDeep hover:underline"
            onClick={() => toggleContent('block2')}
          >
            {expanded.block2 ? 'Жашыруу' : 'Толугураак окуу...'}
          </button>
        </div>

        <h2 className="text-[19px] font-bold text-ink mt-6">Санариптик алдамчылык</h2>
        <div>
          {expanded.block3 && (<div>


            <p className="my-2"><span className="font-semibold">Санариптик алдамчылык</span> – бул санариптик технологияларды колдонуп, адамдарды мыйзамсыз жол менен финансылык пайда алуу же алардын жеке маалыматтарына ээ болуу үчүн алдоо. Бул кеңири түшүнүк ар түрдүү схемаларды камтыйт жана алардын көбү белгилүү бир аймактын, анын ичинде Кыргызстандын өзгөчөлүктөрүнө ылайыкташтырылышы мүмкүн</p>

            <h3 className="font-semibold mt-4 mb-2">Санариптик алдамчылыктын түрлөрү:</h3>
            <ul className="list-disc pl-5 space-y-2">
              <li><span className="font-semibold">Фишинг: </span> Алдамчылар электрондук почта, СМС-билдирүүлөрдү же банктардын, төлөм системаларынын же башка уюмдардын билдирүүлөрүн туураган мессенджерлерде жөнөтөт. Максаты - жабырлануучунун логинин, сыр сөзүн, банк картасынын номерлерин же башка жашыруун маалыматтарды ачууга мажбурлоо. Кыргызстанда фишинг көбүнчө лотереядан утуп алуу, мамлекеттик программалар же белгилүү компаниялардын билдирүүлөрү жамынып колдонулат.
              </li>
              <li><span className="font-semibold">Үн фишинг, вишинг:</span> Телефон фишинги. Өздөрүн банктын, укук коргоо органдарынын же башка уюмдардын кызматкерлери деп тааныштырган алдамчылардын жашыруун маалыматтарды уурдоо үчүн телефон чалуулары.
              </li>
              <li><span className="font-semibold">Фарминг:</span> Колдонуучуларды банктардын же башка уюмдардын чыныгы веб-сайттарына окшош жасалма веб-сайттарга багыттоо. Жабырлануучу өзүнүн маалыматтарын киргизет, ал маалымат алдамчылардын колуна өтөт.
              </li>
              <li><span className="font-semibold">Этникалык жек көрүүчүлүктү козгоо:</span> Этникалык топтор жөнүндө жалган же бурмаланган фактыларды таратуу, терс имидж түзүү, чыр-чатактарды жаратуу, зомбулукка чакыруу. Буга ушактарды таратуу, чагымчыл билдирүүлөр жана тарыхый окуяларды манипуляциялоо кирет.
              </li>
              <li><span className="font-semibold">Скимминг:</span> Банкоматтарда же төлөм терминалдарында орнотулган атайын түзмөктөрдүн жардамы менен банк карталарындагы маалыматты окуу. Бул алдамчылыктын башка түрлөрүнө салыштырмалуу сейрек кездешсе да, Кыргызстанда кеңири таралган.
              </li>
              <li><span className="font-semibold">Инвестициялык пирамидалар / криптовалюта алдамчылыктары:</span> Жок долбоорлорго же криптовалюталарга инвестициялардан тез жана жогорку киреше убадасы. Мындай схемалар көп учурда кирешелүү долбоорлор же чет элдик компанияларга инвестиция катары жашырылат.
              </li>
              <li><span
                className="font-semibold">Интернет-дүкөндөр/жарнама платформалары менен алдамчылык: </span> жок товарларды же кызматтарды сатуу, товарларды жеткирбей алдын ала төлөмдү алуу, жасалма пикирлер жана рейтинг. Бул көйгөй популярдуу онлайн платформаларда кеңири кездешет.
              </li>
              <li><span className="font-semibold">Жеке маалыматты уурдоо: </span> Социалдык тармактардагы аккаунттарды, электрондук почталарды же булутта сакталган маалыматтарды бузуп кирүү аркылуу жеке маалыматтарды алуу. Мындай маалыматтар башка алдамчылык аракеттери үчүн, мисалы, башка бирөөнүн атына насыя алуу максатында колдонулушу мүмкүн.
              </li>
              <li><span className="font-semibold">Социалдык тармактардагы жана мессенджерлердеги алдамчылык:</span> Жасалма профилдерди түзүү аркылуу адамдарды алдап, акча же жеке маалыматтарды алуу. Ар кандай алдамчылык схемаларын жайылтуу жана аларды ишке ашыруу. Жеке билдирүү сыяктуу көрсөтүлгөн зыяндуу шилтемелерди таратуу, бул шилтемелерди баскан учурда адамдардын жеке маалыматтарына кирүү же түзмөктөрүнө зыян келтирүү.
              </li>
            </ul>

            <p className="text-red-500 mt-4 mb-2">
              <strong>Маанилүү!!! Санариптик алдамчылыктын ыкмалары улам өркүндөтүлүп, бул тизмеге кирбеген жаңы схемалар пайда болууда. Алдамчылар жаңы технологияларды жана коргонуу чараларын айланып өтүү жолдорун колдонуп, тактикаларын дайыма өзгөртүп турушат. Ошондуктан, онлайн кызматтарды пайдаланууда киберкоопсуздук боюнча билимиңизди жогорулатуу жана ар дайым этият болуу санариптик алдамчылыктан коргонуудагы эң ишенимдүү жол болуп эсептелет.</strong>
            </p>
          </div>)}
          <button
            className="mt-2 text-[14px] font-semibold text-goldDeep hover:underline"
            onClick={() => toggleContent('block3')}
          >
            {expanded.block3 ? 'Жашыруу' : 'Толугураак окуу...'}
          </button>
        </div>
      </div>
    </div>
  );
};

export default NewReport;
